// pages/movie/index.js
Page({

  data: {
    "image": [
      {
        "path": "../../images/s1.jpeg"
      },
      {
        "path": "../../images/slide4.jpg"
      },
      
      {
        "path": "../../images/slide6.jpg"
      },
      {
        "path": "../../images/slide15.jpeg"
      },
      {
        "path": "../../images/slide17.jpeg"
      },
      
    ],
    "books": [
      {
        "id": 1,
        "bname": "橘子不是唯一的水果",
        "author": "珍妮特-温特森",
        "price": "￥38.7",
        "abstract": "在英国一个偏远的小镇，女孩珍妮特生长在一个信奉福音派新教的家庭里。母亲是一个偏执虔诚的教徒，喜欢将事物分成敌友两派。恶魔，邻居，性是她的敌人，而上帝，她家的狗，夏洛特·勃朗特的小说是她的好友。在母亲的教育下，教会活动成了她日常生活的一切。随着她慢慢成长，珍妮特发现自己与小镇和母亲的偏执并不和谐。于是，当她爱上了另外一个女孩，并且这种超出常规之外的爱被发现后，两者的矛盾爆发了。这场她人生中最初的爱恋在教会和母亲的阻止下无疾而终，但让珍妮特理解了内心的渴望。她离开了小镇和母亲，同时也带着这份决绝进入了她的成年。",
      "image": "../../images/juzibushiweiyideshuiguo.jpg",
        "buy": "天猫"
      },
      {
        "id": 2,
        "bname": "疯狂又脆弱，坚定又柔软 ",
        "author": "朱墨",
        "price": "￥19.6",
        "abstract": "《疯狂又脆弱 坚定又柔软》是朱墨的一部作品集，介绍了作者考研到北京，工作在华谊，以及留学去英国的经历，在这短短几年中她一路升职加薪，25岁升任华谊宣传总监，27岁赚到人生的第一笔100万，30岁却毅然离职去英国留学，在表面的光鲜亮丽之下，她也曾付出过外人所不知道的心血和努力。她的人生告诉我们，每一个身居高位或者肆意潇洒的人，都曾为梦想疯狂地倾尽全力，而那些心怀梦想的人也总是怀揣一颗坚定又柔软的内心",
        "image": "../../images/zhumo.jpg",
        "buy": "微信"
      },
      {
        "id": 3,
        "bname": "窝在角落好安心",
        "author": "横沟百合",
        "price": "￥22.1",
        "abstract": "来自北极却非常怕冷的“小白熊”，觉得自己浑身绿色不像真企鹅的小企鹅，被人丢弃后带着淡淡忧伤和自卑情绪的炸猪排及炸虾尾，还有不管遭遇什么挫折内心都充满乐观和希望的小杂草……每个小萌物的身上都有些与众不同的地方，也正是因为这些与众不同，让小萌物们聚到了一起。读者能感受到角落小伙伴们性格中的自怜、自卑，甚至有些许自闭，却乐观地从不放弃追逐希望的美好一面",
        "image": "../../images/wozaijiaoluohaoanxin.jpg",
        "buy": "当当"
      },
      {
        "id": 4,
        "bname": "教海鸥飞翔的猫",
        "author": "路易斯·塞普尔维达",
        "price": "￥28.4",
        "abstract": "海鸥妈妈因为人类破坏海洋的行为而死，临终前将刚产下的蛋托付给港口的黑猫索尔巴斯，黑猫答应了她的三个要求：不吃海鸥蛋、照顾小海鸥、教会小海鸥飞翔。在港口，一只猫的事情就是所有港口猫的事情。因此，索尔巴斯和他的猫朋友们“秘书”、“上校”、“万事通”和“逆风而上”共同承担起了照顾和教育小海鸥“幸运儿”的责任，他们与无赖猫搏斗、与老鼠谈判、与猴子争理、与人类斗智。为了教会小海鸥飞翔，他们想尽一切办法，翻遍百科全书，甚至不惜破戒与人类开口交谈。之后，在一位诗人的帮助下，在一个风雨之夜，小海鸥终于敞开心灵，飞向了天空。",
        "image": "../../images/jiaohaioufeixiangdenao.jpg",
        "buy": "淘宝"
      },
      {
        "id": 5,
        "bname": "配色设计原理",
        "author": "日本奥博斯科",
        "price": "￥39.0",
        "abstract": "本书通过简明易懂的示例作品，逐条讲解了不可背离的配色理论；将具体的设计案例进行修改前后的对比，分析了如何才能使配色更具效果和表现力；根据希望达到的不同表现效果和目的，展现了设计师必须要了解的配色技巧；介绍了在理论无法适用时应对的配色设计方法；讲解了基本的色彩知识和易用的PhotoShop技法；刊载了日本目前最活跃、最权威的设计师的主题性访谈。",
        "image": "../../images/peiseshejiyuanli.jpg",
        "buy": "京东"
      },
      {
        "id": 6,
        "bname": "我只愿面朝大海，春暖花开",
        "author": "海子",
        "price": "￥24.2",
        "abstract": "我只愿面朝大海，春暖花开》——海子经典诗集，该作品共十辑，收录了海子经典诗集177首，其经典篇目有：《面朝大海，春暖花开》《亚洲铜》《以梦为马》等等。海子是最受青年人喜爱的当代诗人之一，是传奇色彩和最受正义的当代诗人之一，是影响几代人的当代诗人。他擅长写抒情诗歌，他抒情的声音是他众多声音中最响亮、最尖锐的一种，是他被传诵得最远的声音。",
        "image": "../../images/wozhiyuan.jpg",
        "buy": "淘宝"
      },
      {
        "id": 7,
        "bname": "别走，万一好笑呢",
        "author": "银教授",
        "price": "￥17.5",
        "abstract": "有段子，有故事；有趣，有味；有他的调侃，有你的人生。无尖刻语言，无愤世嫉俗的情绪，人活着就挺累了，不如开个玩笑来的随心。故事，引人入胜，环环相扣，让你猜得到开头但猜不到结局。段子，笑就对了。",
        "image": "../../images/biezou.jpg",
        "buy": "天猫"
      },
      {
        "id": 8,
        "bname": "坏狐狸",
        "author": "本杰明-雷内",
        "price": "￥38.4",
        "abstract": "面对一只蠢兔子、一头田园猪、一条懒狗和一只脾气火爆的母鸡，一只孱弱的狐狸想树立起他食肉猛兽的地位。可令它感到无奈的是，它尝试过很多方法都失败了，以至于不得不采取新的战略。它的办法就是：偷鸡蛋，孵出小鸡，养大它们然后吃掉。但是，当狐狸发现它的父爱大爆发后，它的计划也开始变味儿……",
        "image": "../../images/huaihuli.jpg",
        "buy": "当当"
      },
      
    ]

  }

})